Revit 2027 API
View3D.ScalePerspectiveCropBox Method
 Scale an existing crop box of the perspective view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void ScalePerspectiveCropBox(
	double multiplier
)
Public Sub ScalePerspectiveCropBox (
	multiplier As Double
)
public:
void ScalePerspectiveCropBox(
	double multiplier
)
member ScalePerspectiveCropBox :
        multiplier : float -> unit
Parameters
multiplier Double
 Multiplier to change the view scale and the current crop box size on both X and Y.
Exceptions
Exception | Condition
InvalidOperationException |  Returns true if the view is not a view template.
Remarks
Remarks
 In addition to changing the view crop box, this operation also makes the change analogous to changing the scale of the orthographic view, so that both the size and scale of the view on a sheet changes according to the provided argument 'multiplier'.
 For getting or setting view crop box size use property CropBox
See Also
Reference
View3D Class
Autodesk.Revit.DB Namespace